

table = \
"""
泉	8	泉線 原願源腺  隙 踏	6: Ручей  текущий Линией на Равнине  Источник моего Желания (выпить воды в ручье) в Гландах - Ступить в Угол ручья
寺	8	寺時待持詩等特侍	Храм 8 Самур Несет(в руке) Поэму(слова в храме) Особого(коров) Класса(бамбук) в Храм в Час Ожидания (на дороге)
木	4	本鉢体休	Дерево в Горшке - источник Книг  Отдыха и Тела
袁	3	遠園猿 	Обезьяна в Далеком Саду
罒衣	4	壊懐 還環 	Поломанная Ностальгия о Возвращение Кольцо
周	6	周週調彫鯛綢	Окружность - Неделя Исследования Вырезания по дереву Морской карась Густой (суп)
谷	8	谷容欲俗裕浴溶熔	Долина - Содержимое Желания Купаться в Таение снега ведет к Народное Процветание  /Долина Содержимое - Народ с языком принимают душ из Талого снега и Плавленого металл
母	10	母苺 海毎梅敏繁悔侮晦	Мать Мать ест Клубнику. в Каждом Море Слива Проворно (идти/бегать) и Часто, Сожалею (сердечное) о Брани в Последний день месяца
可	12+2	"可何哥歌阿苛荷河呵奇寄騎椅崎埼  /倚柯"	"Возможность - Что есть 2 возможности Брата  брат поет Песню об Африке и Суровом Багаже в Бранящей Реке.Странный Приблизился Верхом на Стуле на Мысе и малом Полуострове"
殳	17	没役股 設般搬盤 段鍛 殿撃投殺穀毀殴疫毅	Топор - Затонул в Роли Паха  Основал Обычный Перенос по Ступеням Закаленным во Дворец для Нападения Кидать  чтобы Убить Подносом Скорлупой Атаковать Эпидемию
予	10	予序野預 矛柔務霧  抒豫	Алебарда(перед) - Пролог Дикого Поручения  Алебарда с тесемкой - Мягкий Долг в Тумане
㕣	3	船沿鉛	Вдоль реки Свинцовый Корабль
召	7	召沼招昭照超紹詔	Зов к еде- Зов Болота Манит Освещая Иллюминацией (+огонь) Супер Представление - Императорский указ
肖	11	肖消削宵梢硝 哨屑鞘    銷悄	Похожесть - Исчезает Наточить Вечерними сумерками Часовой сторожит Отбросы  на кот. Кончика ветки Нитратами делается Ножны
青	8	青晴情清精静請積  /靖錆稍逍	Синий - Ясный день Чистые Чувства Духа Тихо Спрашивают Складывают
	4	責債績漬   貞偵
主	20	主柱注往住註駐 狂旺望呈程皇聖潤徴懲 班斑  王玉宝国	Хозяин- за Колонной Внимательно Ходил туда-сюда где Живет  Комментировал  где Припарковался. Сумасшедший король Процветал Мечта Процесса Императора Святого Демонстрирования Влажные Знаки Наказания. Класс Пятнистых Яшм.
列	4	列例烈裂	Кенгуру с копьем - Линия для Примера Суровой Разрезания
寸		寸村対将導射謝封守狩討尋奪 尊遵  耐冠寿厨辱爵肘 /付得	Запястье - Деревня Против Генерала Ведущего Стрелков Повесивших Извинения за Атаку Спрашивают Отнять Почтительную Выносливость Короны Долголетия Оскорбляет Графский Локоть
専	6	恵穂専博縛 -> 溥 -> 薄簿  	Мудрость Колоса Специальный Добрый Доктор Завязал Тонкий Журнал
甫	13	甫哺捕補舗浦輔蒲匍葡 /搏傅 庸	(Только)Сосанием Схватить Ассистента в Магазине на Виноградном Берегу   (ほ) →
聿	8	書筆建健律津鍵 /儘	Книга Кистью Строить Здоровый Закон Волны Замок
市	3	市姉肺柿	Старшая сестра на Рынке Легкое продавала и Хурму
未	3	未妹味昧魅  末抹	Младшая сестра Чарующий Вкус
朱	5	朱株殊珠蛛	(しゅ) Киноварные акции необычная Сфера Паука
直	5	直置植値殖 	Прямо Положить и Сажать растения и Цены Увеличивать
真	5	真鎮填顛慎  具惧         塡	Истина  Успокоит Заполнит Вершину Скромности
則	5	則側測惻	Правило Стороны в Исследовании Глубокого сострадания
夕	8	夕多移名銘外夜夢汐拶 夜液腋	Много Вечеров Перемещать Имя Наруже Ночной Сон Прилива
夗	5	怨苑宛腕碗	Зависть Сада Цель Руки Чаша
乍	5	作詐炸昨搾酢窄柞	(さく) Расческа Делать Мошейничать Взрывать Вчера Втискивать Дуб
各	11	各路格客略落絡額閣擱駱咎喀酪賂	(かく)
里	9	理黒量童野埋纏狸鯉	Деревня
昜	13	昜場湯陽傷揚楊暢腸賜  蕩瘍	(Солнце сквозь тучи) Место Кипяток Солнце Рана Поднять Ива Вытянуть Кишки Дар
音	11	音意識響職章織竟暗闇韻幟熾  	Смысл Признание Эхо Занятие Глава Ткать Конец Мрак Ритм / Флаг
意	4	意億憶臆	Смысл 10млн Память Трусость
攵	40	枚政数教放故做変改整故致緻微激散攻敢敗救敵繁敬 徹撤 敏牧徽弊敷 	Идти (ほう  ぼう)
方		方放倣防妨肪坊紡房謗傍芳訪
莫	11	模幕摸漠慕膜墓募暮	Конец
夂	6	愛曖   暖媛援緩	Любовь
至	5	至室握到倒	Достичь Комнаты Схватить Достичь СОкрушить
雨	17	雨雲曇電震露需儒雪零漏雰霊雷霞霧霜靄	Дождь Облако
田	10	田細異翼畏胃謂界畔苗描猫膚奮 思慮畑累留	Поле
韋	5	韋葦偉違緯衛韓	Кожа
果	6	果彙菓課巣裸	Плод
貝	3	貴遺潰	Дорогой
兑	7	鋭悦閲説税脱 況	Брат с рогами
曷	7	謁喝渇褐葛 胸掲	Обертка
秀	5	秀透誘  携躱
虍	5	虞劇虎虚虜
咼	6	渦過禍鍋蝸窩	(か) слишком
圣	5	怪径茎経軽	стебель
皆	4	皆階楷諧 陛
亥	5	劾該骸核刻
圭	6	崖涯街掛封佳蛙 /桂畦珪罫鮭硅	 (けい)
既	3	慨概既
交	9	交校絞狡較郊効咬	(こう) →
隺	5	確歓観権勧鶴
舌	3	括活話辞乱憩	tongue
其	10	甚其期欺棋基旗勘堪碁	(き) →
巨	15	覧監艦鑑濫藍檻 堅賢堅緊腎 蔵臓藏
官	4	官棺管館 追 遣	(かん) →
支	7	支伎岐技鼓枝肢
ущерб	7	破毀壊砕崩潰  滅
敬	3	敬驚警
方	6	旗施族旋旅遊
軍	4	軍輝揮運 暈	Повозка под крышей - армия, сияние, руководить, перевоз
義	6	義儀議犠蟻艤
及	5	及吸級扱汲	достигать, вдыхать, степень, обращаться, черпать
求	3	求救球	искать, спасать, сфера
巨	7	巨拒距矩臨姫臥	гигать, отрицать, расстояние, ,временно, принцесса, лежать на спине
京	8	京景影憬涼諒掠鯨就蹴	столица, пейзаж,тень,мечтать,занимать положение, прохлада, прощать, грабить кит
夹	4	峡挟狭頰
喬	6	喬橋矯驕僑嬌
堇	3	僅謹勤
禺	4	愚偶遇隅
屈	6	出拙屈掘窟堀	貿
喿	4	繰操燥藻	 привет
糸	7	糸系係孫遜 紫繋雌	けい
旨	6	旨詣指脂嘗稽
佥	5	倹剣険検験
兼	4	兼嫌謙鎌廉
艮	10	艮銀根恨限退眼痕墾懇    /喞嚮廏廐曁欝漑鱶
良 w/dot	17	良浪狼朗娘廊 慨概 爵嚼既郎卿厩 即節櫛	 (りょう)
古	6	古固故苦枯個錮沽湖箇姑  居据裾	(こ)
呉	3	呉娯誤
亢	3	坑抗航
矢	3	矢侯候喉  医 嫉疾  知痴
更	4	更硬梗便 史吏使
冓	4	溝構講購
襄	5	壌嬢譲醸嚢
岡	4	岡綱鋼剛
辰	9	辰辱唇娠振震農濃賑  展	(しん)
夋	3	唆俊酸
𢦏	5	栽裁載戴截
申	6	申神伸呻押紳	(しん) →
正	6	症証正政征整 延誕	(せい) →
同	7	同洞胴銅桐恫筒
司	5	司伺詞嗣飼	(し) →
	4	摯執 塾熟熱	bowl
兹	3	滋慈磁
昔	6	借惜籍錯散措
叔	6	叔寂淑督 叙戚
耂	10	者都 煮署緒諸著賭箸暑屠	mono
耂		老考拷孝教酵	(こう)
童	6	童障憧鐘瞳撞
羊	6	羊祥詳鮮南洋痒遅
羊	4	着差羞羡
兆	5	兆逃桃挑眺跳銚
咅	5	倍培陪部賠剖
白	11	白伯拍泊迫舶百  狛柏箔珀
重	3	衝動働種腫勲薫
㒸	5	㒸隊墜逐遂縁 家塚豚嫁稼豪
啇	5	嫡摘滴適敵 商	trade
中	6	中仲沖忠虫狆
包	7	包抱泡胞砲飽咆	(ほう
丁	10	丁貯庁町頂訂亭停灯寧	nail
長	4	長張帳脹	(ちょう) →
豆	5	豆短痘登頭闘澄
付	7	付府附符腐俯	ふ)
敝	3	幣弊蔽
辟	3	壁璧癖避
免	4	免勉逸晩
	4	僚寮療瞭
令	6	令領冷鈴零齢命	(れい)
高	4	高縞稿藁	(こう) →
	6	峰峰逢縫蜂蓬	(ほう)
共	5	共供恭洪哄	(きょう  こう) →
旦	5	旦但胆疸担	(たん) →
安	5	安案按鞍鮟按鞍	(あん) →
㐱	4	珍診疹参惨	(しん) →
亡	6	亡忙忘盲荒望妄	(ぼう) →
成	5	成盛誠筬城	(せい) →
采	4	采彩菜採	(さい) →
反	7	反版板坂飯販叛	(はん) →
次	4	次茨恣盗姿吹諮資羨	(し) →
𢎨	4	弟第剃涕	(てい) →
果	5	果課菓踝顆	(か) →
廷	4	廷庭挺艇	(てい) →
相	4	相想箱霜	(そう) →
𠔉	8	券巻圏拳 勝騰藤謄	 (けん) →
非	7	非悲緋誹扉鯡琲	(ひ) →
夋	7	俊酸峻唆逡竣浚 悛	(しゅん) →
皮	6	皮彼被疲被披	(ひ) →
扁	8	扁編遍騙偏篇蝙翩	(へん) →
富	5	福副幅富蝠  	(ふく) →
复	5	複復覆腹履
曹	4	曹遭槽糟	(そう) →
立	5	立竜滝粒笠龍	(りゅう) →
己	5	己起記紀忌已	(き) →
分	9	分粉紛盆頒雰貧芬寡 忿扮	(ふん) →
昌	5	昌娼唱晶菖  	(しょう) →
昔	4	昔借惜錯	(しゃく) →
我	6	我峨蛾餓俄鵞	(が) →
几	4	几机肌飢	(き) →
甬	6	通桶痛勇湧涌誦踊	(つう) →
氐	5	低底抵邸抵	(てい) →
尚	8	尚常裳掌党堂賞償	(しょう) →
化	5	化花貨靴訛	 (か) →
且	16	且粗祖狙阻組助姐縣宜租懸誼畳鋤咀	 (そ) →
由	7	油宙抽袖届笛軸
	6	朋崩棚硼鵬繃	 (ほう) →
	11	干汗肝奸刊岸竿幹杆旱軒	(かん) →
	10	生姓性星牲惺産隆甥甦	(せい) →
	4	旬洵殉恂	 (じゅん) →
	6	半伴 絆拌判	(はん) →
	4	采彩菜採	(さい) →
	14	士仕壮志誌声売款吉潔 裝寿嘉壺	(し) →
	5	浅銭践残賤	(せん) →
	4	因姻咽恩	гигант за забором
	3	石岩妬  研確破礎碼硬磨	Камень  stone
	3	衣依袋	Одежда
	3	元完院玩	moto
eternal	3	永泳詠 氷	Вечный
央	3	央英映	Штангист
𤇾	4	栄営蛍労
牙		牙 芽雅訝鴉	клык  fang
耂		者孝教老考	(こう) →
垂		垂睡唾
曾	5	僧層増憎贈	(そう) →
𠦝		朝嘲潮斡乾
彳山		微徴懲
		酒猶尊遵蹲樽	respect
屯		屯頓鈍純
нога		足促捉
式	3	式拭試
	4	読売続涜
		某謀媒
		委萎
		為偽
		威減	feeling
		尉慰
		快決
		卸御
		穏隠
斗		斗科料斜魁	ковш
亠厶		棄充 疏琉硫流  育徹撤
		穫護獲
疑		疑凝擬
		却脚
топор		迎仰抑昂
		傑舞
吉		結周嘉
		契喫
		境鏡
		荒慌
шип		策刺
		舎捨
признать		承蒸
		臭嗅
		誇袴跨
		鼓嘉樹膨
90		粋酔砕枠
та		池他地施馳
очередь		番翻審蕃藩
пучок		束速勅頼瀬辣疎
вред		害轄割
		亜唖悪	Зло
		昆混
		攻功
広		広鉱払拡仏 沸  	  wide
失		失迭鉄秩
占		占店点粘鮎帖貼
余		余除途徐塗斜  茶
		棒俸
鬲		融隔
		憂優
戊		蔑茂成威滅戚歳
衣		哀衰衷裳褒裹
衣		表製装依滾袋裁裂襲
		挨埃
		惑域感憾	feeling
比		比批皆昆鹿屁斃
		庶遮
		燃然
		受授
		深探
		新薪親	new
		黄横
帚		帚帰婦掃
		従縦
巴		絶色把肥爬芭	glass
罒		買罰羅罵罪置署  聴徳夢罷憲蔑爵	 net
争		争浄静
骨		骨滑骸髄猾	bone
票		票標漂飄
		港
合		合給答恰拾塔搭
台		台冶治始胎怠颱
尺		尺沢択駅訳釈昼
壬		妊任庭廷淫賃
前		煎前 輸愉喩癒
侖		倫論輪綸
戸		戸扇扉屋尼泥炉	door
		転伝魂	transmit
麻		麻摩磨魔暦歴
奚		渓鶏
幾		幾機
升		升昇弄算弁葬奔	  hands up
禁		禁襟
穴		穴空控突突穿窮窃窄窯窪窓
有		有賄肴郁堕随
stick		訃朴赴
		炭岸
		孔乳礼乱札軋
非		俳扉靠排罪悲輩匪雇顧尿 戻涙
忍		認忍
少		少劣抄省妙賓秒砂沙
		曲典
頃		傾頃	 earth
巾		巾布希怖飾	拓 stone
曽		曽増憎層	裏 cloth
		若諾匿
		柳卵聊卿
		辛宰幸達
		季	飴 platform
		賛潜	翳 feather
今		今吟念捻含琴陰蔭貪	 today
帯		帯滞	斉済 inter
		吐
		僕撲業	鋳 age
友		友抜	会 picture
東		東棟練凍陳欄錬	凹
		暴爆	写  partici

		定綻錠
必		必秘泌密蜜	祈 iwau
左		左佐	 畿  how much
		塞寒	窒 room
乗		乗剰
象		象像	述 tree
奴		奴怒努
家
止		止企武祉  賦肯渋	weap
		垣宣恒	const
弱		溺弱鰯	weak
		閉
昏		昏婚
彦		彦顔
先		先洗
		戒械
示		示祭際察擦	point
厄		厄危犯氾範
車		車庫連軟陣	car
敢		最撮敢厳	dare
		泰春奏奉棒秦
焦		焦礁	focus
翟		濯躍耀曜
壮		壮荘装
単		単弾禅戦	simple
立		立泣位拉翌笠	stand
秋		秋愁
君		群郡
		麺面	face
		宿縮
		芝乏
		午年牛
		崇宗踪
		兄祝克党呪	brother
		派旅脈
		難灘漢嘆
走		越起超趣徒赴赳
		度渡
斬		暫斬漸
		刀刃
		折哲逝
		浸寝侵
冘		沈枕耽
		喚換
		丸
才		才材財
		送
		噴墳憤
		員損	 bureaucrate
並		並餅瓶併塀  形刑型  	   narabu
		弥称
		悟語
		間簡
炎		炎淡談
		竜籠
文		文紋蚊
冊		冊柵
屰		逆遡塑
		冒帽
		平評坪
川		川訓馴 酬州順
反		反返阪仮	against
		卓悼	table
区		区欧殴駆凶枢鴎	europe
		歩頻渉捗	step
		聴徳  煙
录		緑録剝禄
		栃励 	praise
		益溢
全		詮全栓	all
風		風嵐
章		章彰
赤		赤赦  跡変
		釣約酌 均 勾 	scoop
		氏民眠
		爪狐	nail claw
鬼		鬼塊醜魔魂魅	demon
魚		魚漁	fish
		駄
切		切窃 	cut
代		貸袋
		斉済剤  介 	inter
倉		倉槍創
		冗凡汎 帆築
		腰要覇
		能熊罷
		郷響
句		句駒局拘
		託宅
		出屈拙堀
		豊艶

		替賛
		膝漆
		冬終
		統銃
		盾循 逓	shield
		脅協脇	3 powers
		弧抓	nail
帝		帝締蹄諦
		綿	 hole   cotton
		索
		査	moreover
		星醒	star
普		普譜	common
		兵浜
		以似	similar
			mornint
		呂侶宮	furo
		甘紺
		缶陶揺謡	jar
		串患
		波
		素
		太汰
		与
		巡災
入		入込
		匠
告		告造酷	koku
		人十乙六肉水皿上了千天来五弐内女一目八
		行月匹米芸西耳万再山字斤夏
		堤是提題
		喜
		斥
		朕咲
		凸
		鹿麗
		蛮
甲		甲押岬
		漫慢
		催
		利痢
		丈杖
		粧圧
		角解	発 continue
		去
		錦	cotton
		言誉信
		純
		明盟
		丙病柄	ogara
		断継	continue
		謎迷
		報服
		絵	尹 kimi
		食飲飯餐養館飽飾餓餅倉飢蝕飼饅餃
		貫慣
		術
		烏嗚鶯
		羽習
		伐閥
		畜蓄
		北背
		門問聞間
		冥宴 寛
		玄舷弦 幼幻
		雑堆誰椎准唯維帷稚
		朽巧
善		善膳繕
公		公松訟翁総 私	public
奄		奄俺庵	夷
于		于迂宇盂芋
"""

def to_span(text):
    cur_text = ''
    for sym in text:
        if 0x4e00 <= ord(sym) <= 0x9fff:
            cur_text += '<span class="kanji_widget">' + sym + '</span>'
        else:
            cur_text += sym
    return cur_text


html = ''

for line in table.split('\n'):
    #line = line.strip(
    if len(line) != 0:
        html += '\t<tr>\n'
        for item in line.split('\t'):
            html += "\t\t<td>"
            html += "" + to_span(item) + ''
            html += "</td>" + '\n'
        html += '\t</tr>' + '\n'

print(html)